import lumi from '../../public/lumi.jpg'
import lumiStatic from '../../public/lumiStatic.png'
import lumiAndgg from '../../public/lumiAndgg.jpg'
import temmie from '../../public/temmie.jpg'
import edgar from '../../public/edgar.jpg'
import cryingSkull from '../../public/cryingSkull.jpg'
import lumiInSquare from '../../public/lumiInSquare.jpg'
import gg from '../../public/gg.jpg'
import drunkenCherry from '../../public/drunkenCherry.jpg'
import frozenScream from '../../public/frozenScream.jpg'
//
// Структура данных: категория -> подкатегория -> детальная информация
export const gameData = {
  characters: {
    id: 'characters',
    title: 'Персонажи',
    description: 'Все герои нашей игры',
    icon: lumiStatic,
    items: {
      Lumi: {
        id: 'Lumi',
        title: 'Люми',
        description: 'Любопытная дьяволица',
        details: 'Девочка-демон, по характеру пытается быть крутой, но у неё все валится из рук',
        image: lumi,
        gallery: [
          {
            image: lumi,
            axial: 'vertical'
          },
          {
            image: lumiAndgg,
            axial: 'horizontal'
          }
        ],
        dialogues: [
          {
            title: 'Первая встреча с ГГ',
            lines: [
              { speaker: 'ГГ', emotion: 'воспоминание', text: 'Знаете порой я думаю, что я счастливчик. У меня было всё! Деньги, тачки, популярность! Я мог жить ни в чем себе не отказывая... Ага... Поверили...' },
              { speaker: '...', emotion: '', text: 'Кадр меняется на нашего гг сидящего на крыше. Снизу стоят 3 черта кидающие камни в гг.' },
              { speaker: 'ГГ', emotion: 'злость', text: 'Да что вам от меня надо! ОТСТАНЬТЕ!' },
              { speaker: '...', emotion: '', text: 'Черт кидает д20 на попадание и бросает камень впрямо в голову гг.' },
              { speaker: 'ГГ', emotion: 'боль', text: 'Ай бли... *Упал*' },
              { speaker: '...', emotion: '', text: 'Черти окружают нашего гг, пытаются уже либо отпиздить, либо обокрасть. Следующим кадром появляется Люми. 3 ударами выбрасывает чертей вдаль.' },
              { speaker: 'Люми', emotion: 'боевая', text: 'ПРЕЖДЕ ЧЕМ БУЛИТЬ СЛАБАКОВ СТАНЬТЕ САМИ СИЛЬНЕЕ!' },
              { speaker: '...', emotion: '', text: 'Люми подходит к гг и удивляется.' },
              { speaker: 'Люми', emotion: 'удивление', text: 'Странный вид чертей у нас тут завелся' },
              { speaker: 'ГГ', emotion: 'молчание', text: '...' },
              { speaker: 'Люми', emotion: 'насмешка', text: 'Язык проглотил?) А минуту назад визжал как девчёнка (и типо высовывает язык)' },
              { speaker: 'ГГ', emotion: 'благодарность', text: 'Спа... Спасибо' },
              { speaker: 'Люми', emotion: 'равнодушие', text: 'Ме... Скучно. Ладно, бывай' },
              { speaker: 'ГГ', emotion: 'паника', text: 'Стой!' },
              { speaker: 'Люми', emotion: 'раздражение', text: 'Ну что ещё?' },
              { speaker: 'ГГ', emotion: 'растерянность', text: 'Где я?' },
              { speaker: 'Люми', emotion: 'недоумение', text: 'Ты тут сахара переел че ли? Мы в ...' },
              { speaker: 'ГГ', emotion: 'вопрос', text: 'Кто ты?' },
              { speaker: 'Люми', emotion: 'гордость', text: 'Ну ладно, ладно) Меня зовут Люми. Знай своего спасителя' },
              { speaker: 'Люми', emotion: 'недоверие', text: 'Ты меня не знаешь? Меня все здесь знают... Ты там в сидре мозги пропил?' },
              { speaker: 'ГГ', emotion: 'непонимание', text: 'Чего?' },
              { speaker: 'Люми', emotion: 'снисходительно', text: 'Ай ладно, меня зовут Люми, запомни и не забывай!' },
              { speaker: 'ГГ', emotion: 'отчаяние', text: 'Кто я?' },
              { speaker: 'Люми', emotion: 'сарказм', text: '... А мне откуда знать?! Дурак скорее всего.' },
              { speaker: 'Люми', emotion: 'нетерпение', text: 'Всё? Доволен ответами... Ладно, может будет что интересного там' },
              { speaker: 'ГГ', emotion: 'воспоминание', text: 'Погоди... Последнее что я помню... У меня закончились пары... Зашел в магазин... Пришел домой... Сел за комп и... И оказался здесь... ЧТО ЗА?!' },
              { speaker: 'Люми', emotion: 'непонимание', text: 'Ты че несешь чел...' },
              { speaker: 'ГГ', emotion: 'надежда', text: 'Это сон? Мне это просто снится... Хотя стоп! Я же почувствовал удар о землю...' },
              { speaker: 'Люми', emotion: 'беспокойство', text: 'С тобой точно все в порядке? Странные нынче черти)' },
              { speaker: '...', emotion: '', text: 'у чела сужаются зрачки и он сходит сума' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'ИЗЫЙДИ ЧЕРТОВА БЕСТИЯ! (ставил пальцы в виде креста)' },
              { speaker: 'Люми', emotion: 'обида', text: 'Ага. Значит так ты меня благодаришь за пасение' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'Я досчитаю до трёх и все это закончится' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'Один..' },
              { speaker: 'Люми', emotion: 'игриво', text: 'Два)' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'Три...' },
              { speaker: 'Люми', emotion: 'игриво', text: 'Четыре' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'Ля.. Что за фигня!' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'Не я понимаю... Грешил. У всех есть грехи! Но чтобы сразу в ад! Где мой горем райских ангелов!' },
              { speaker: 'Люми', emotion: 'непонимание', text: '•-•' },
              { speaker: 'ГГ', emotion: 'безумие', text: 'Ущепни меня!' },
              { speaker: '...', emotion: '', text: 'щепает' },
              { speaker: 'ГГ', emotion: 'боль', text: 'Ауч! Все! Я в аду. Добро пожаловать.' },
              { speaker: 'Люми', emotion: 'зловещая', text: 'А ты становишься интересным) НРААААААИТСА) (и жудковатая улыбка с заострёнными зубами)' },
              { speaker: 'ГГ', emotion: 'любопытство', text: 'Почему ад такой яркий? Я думал он будет жудким... типо.. котлы с кипящей лавой.' },
              { speaker: 'Люми', emotion: 'безумие', text: 'Значит здесь слишком мило? Хочешь устрою настоящий АД? (жудкие или бешенные глаза)' },
              { speaker: 'ГГ', emotion: 'испуг', text: 'Стой! Не меняй ничего!' },
              { speaker: 'Люми', emotion: 'высовывает язык', text: 'Хах! Ты бы видел свои глаза. Я не так крута чтобы всё тут перевернуть' },
              { speaker: 'ГГ', emotion: 'грусть', text: 'Ты надо мной издеваешься(' },
              { speaker: 'Люми', emotion: 'хитрая', text: 'Ххх... Ладно. Пошли) Отведу тебя в место поспокойнее' },
              { speaker: 'ГГ', emotion: 'недоверие', text: 'Ага! Так сразу и поверил АДСКОМУ СОЗДАНИЮ!' },
              { speaker: 'Люми', emotion: 'обида', text: 'Ты че заладил то? ... Хммм) Ладно, не иди за мной. Чертям тоже надо что-то кушать (развернулась чтобы уйти)' },
              { speaker: 'ГГ', emotion: 'смирение', text: 'Пошли -_-' },
              { speaker: 'Люми', emotion: 'хитрая', text: 'Что ты сказал? Хочешь остаться с чертями вместо того чтобы пойти с дьявольским отродием?)' },
              { speaker: 'ГГ', emotion: 'вина', text: 'Я готов пойти с тобой.. и.. прости' },
              { speaker: 'Люми', emotion: 'радостно', text: 'Ну раз уж ты сам захотел.. Погнали! (Утаскивает ГГ за руку)' },
              { speaker: '...', emotion: '', text: 'Дальше может быть либо платформер, либо должны будем доджить чертей. Что-то да надо, чтобы добраться до телепорта. Там уже тепаемся в центр, к таверне.' }
            ]
          }
        ]
      },
      GG: {
        id: 'GG',
        title: 'ГГ',
        description: 'Попаданец в ад',
        details: 'Быстро меняет эмоции, быстро паникует, быстро успокаивается, имеет личность и не является обычной заглушкой',
        image: gg,
        gallery: [
          {
            image: gg,
            axial: 'vertical'
          },
        ],
      },

      Temmie: {
        id: 'Temmie',
        title: 'Темми',
        description: 'Забавный барахольщик',
        details: 'Выглядит как недо-учёный',
        image: temmie,
        gallery: [
          {
            image: temmie,
            axial: 'vertical'
          },
        ],
        dialogues: [
          {
            title: 'Выборы диалогов с ГГ',
            lines: [
              { speaker: 'ГГ', emotion: 'нейтрально', text: 'Привет!' },
              { speaker: 'Темми', emotion: 'радостно', text: 'Смотрите кого к нам занесло! Приветствую человек! Имя? Меня тут обычно только по кличкам вызывают... Так что забей. Зови просто Тэм... По крайней мере меня так назвал кто-то давно... Я тут что-то на подобии информатора и поставщика. Если что-то надо — обращайся, найду. За шекели конечно же' },
              { speaker: 'ГГ', emotion: 'нейтрально', text: 'Расскажи об этом месте' },
              { speaker: 'Темми', emotion: 'задумчиво', text: 'Это место? Ты имеешь ввиду таверну? Да? В таверне тепло, уютно... Иногда правда меня бармен пытается выпнуть, но... У него почему-то не получается) Возможно я прилип к этой куче хлама...' },
              { speaker: 'ГГ', emotion: 'лукаво', text: 'Знаешь что-то о внешнем мире?' },
              { speaker: 'Темми', emotion: 'испуг', text: 'А? Ты спрашивал про внешний мир?... ... ... Я НЕ ВЫЙДУ ОТСЮДА! НЕЕЕЕЕЕТ! *Дрожит*' },
              { speaker: 'ГГ', emotion: 'с презрением', text: 'Как ты докатился до такой жизни..' },
              { speaker: 'Темми', emotion: 'хитрая', text: 'Мастерство убеждения друг мой, мастерство убеждения. Не зря я сутками изучал разные игры, вот и оказался здесь) Что?...' },
              { speaker: 'ГГ', emotion: 'с презрением', text: 'Слушай, мне  тут один дед нашептал, что у тебя можно достать оружие)' },
              { speaker: 'Темми', emotion: 'суетливо', text: 'А? Тебя бармен отправил ко мне? Ладно... Щя... ... *Роется в хламе* Такс... Не, это сценарий... Это вообще коллектоболс... А! Во! Держи друг, надеюсь он тебе послужит хорошую службу! Но если он тебе не понравится, можешь вернуть обратно?' }
            ]
          }
        ]
      },
      Edgar: {
        id: 'Edgar',
        title: 'Эдгар',
        description: 'Владелц бара',
        details: 'Старик который все увидел в этой жизни, сдержанный, обзывается. Атлет бронзового века Раньше он с интересом разгадывал тайны этого места, покорял стражей слоёв. Стал чемпионом колизея. Но в один день он пал от неизвестного и решил закончить свой путь в этом месте. Основал таверну у выхода и теперь каждый день прогоняет по стопке белой.',
        image: edgar,
        gallery: [
          {
            image: edgar,
            axial: 'vertical'
          },
        ],
        dialogues: [
          {
            title: 'Первая встреча',
            lines: [
              { speaker: 'Бармен', emotion: 'недовольство', text: 'Люми, я же говорил не приводить сюда всякую дрянь...' },
              { speaker: 'Люми', emotion: 'обида', text: 'Это не дрянь! Это ЧЕЛОВЕК!' },
              { speaker: 'Бармен', emotion: 'удивление', text: 'Ч... Интересно... Тогда добро пожаловать в бар "Перепутье". Зови меня Эдгар, парень. Я владелец этого места.' }
            ]
          },
          {
            title: 'Первый разговор',
            lines: [
              { speaker: 'ГГ', emotion: 'любопытство', text: 'Что это за место?' },
              { speaker: 'Эдгар', emotion: 'спокойно', text: 'Это место — мой бар. Правило одно: не мешать другим посетителям.' },
              { speaker: 'ГГ', emotion: 'вопрос', text: 'Что ты знаешь о внешнем мире?' },
              { speaker: 'Эдгар', emotion: 'равнодушие', text: 'Внешний мир? Ничего особенного... Сладкая страна грез, где бегают черти разных сортов.' },
              { speaker: 'ГГ', emotion: 'интерес', text: 'Как ты докатился до жизни такой?' },
              { speaker: 'Эдгар', emotion: 'усталость', text: 'Не хочу вспоминать былое... Я устал от него... Сейчас моя жизнь здесь, за барной стойкой. В компании посетителей... И этого инвалида в углу...' },
              { speaker: 'ГГ', emotion: 'надежда', text: 'Может у тебя где-то за спиртным завалялось оружие?' },
              { speaker: 'Эдгар', emotion: 'раздражение', text: 'Я не хочу дотрагиваться до оружия! ... -.- ... Нужно оружие? Спроси у инвалида в той куче хлама.' },
              { speaker: 'Эдгар', emotion: 'осознание', text: '...' },
              { speaker: 'Эдгар', emotion: '-.-', text: '-.-' },
              { speaker: 'Эдгар', emotion: 'нейтрально', text: 'Нужно оружие? Спроси у инвалида в той куче хлама.' },
            ]
          },
          {
            title: 'Повторная встреча',
            lines: [
              { speaker: 'Бармен', emotion: 'спокойно', text: 'Добро пожаловать. Что будете брать?' },
            ]
          },
        ]
      },
    }
  },
  locations: {
    id: 'locations',
    title: 'Локации',
    description: 'Мир игры',
    icon: cryingSkull,
    items: {
      cryingSkull: {
        id: 'cryingSkull',
        title: 'Площадь Плачущего Черепа',
        description: 'Если сесть на скамейку, она тебя не отпустит',
        image: cryingSkull,
        gallery: [
          {
            image: cryingSkull,
            axial: 'horizontal'
          },
        ],

        content: `
        Находится в той же локации где и бар
        `,
      },

      drunkenCherry: {
        id: 'drunkenCherry',
        title: 'Пьяная Вишня',
        description: 'Бар старого черта',
        image: drunkenCherry,
        gallery: [
          {
            image: cryingSkull,
            axial: 'horizontal'
          },
        ],

        content: `
        Находится в той же локации где и Площадь Плачущего Черепа
        `,
      },

      frozenScream: {
        id: 'frozenScream',
        title: 'Застывший крик',
        description: 'Предварительно финальная точка',
        image: frozenScream,
        gallery: [
          {
            image: frozenScream,
            axial: 'horizontal'
          },
        ],

        content: `
        База Люцефера, перед ней стоит охранник
        `,
      },

      twerx: {
        id: 'twerx',
        title: 'Тверкс',
        description: 'Говорят, что на левой стороне больше платят',
        content: `
        2 завода. Дают выбор куда пойти. Сполер: ни на что он не влияет. Куда бы ты ни зашел: они идентичны. Вступаешь за порог и усыпаешь. Просыпаешься в классе с ноунеймами, Люси, Соперником. Тут на телевизоре включается запись: вы тут заперты, убей кого-нибудь чтобы выбраться. Кто-то выходит в центр и кричит Я В ЭТИ ИГРЫ УЖЕ ИГРАЛ, начинается беспорядок. Кто-то из толпы спрашивает: а почему нельзя просто разбить окно и сбежать. На что похититель отвечает: Э БЛЯ! НЕ ВЗДУМАЙ! КАЗЕНОЕ ИМУЩЕСТВО! Я ДЛЯ ВАС ШОУ УСТРОИЛ, А ВЫ ХОТИТЕ СЛОМАТЬ МОЙ КОНЦЕПТ?! Надо придумать почему мы отправимся в глубь фабрики. Отправляемся в глубь, решаем квесты с ящиками, проходим пару квестов и добираемся до финальной комнаты, где находится связанный владелец фабрики. Его развязываем, спорим с человеком кто его заточил. Им оказался наш торговец, который хотел сделать шоу ради просмотров. Торгашу выдают пиздюлей, Гг получает печать и уходит. Ночь не продумана

Квесты: принеси ведро гов... Шоколада.
Найди секрет производства шоколада
Посоревнуйся с Соперником
        `,
      },
      coldPeaks: {
        id: 'coldPeaks',
        title: 'Леденцовые холодные пики',
        description: 'Звучит холодно и сладко',
        content: `
        Здесь можно реализовать платформер, где персонажу надо добраться до пика, где в пещере будет ждать его нпс, выдающий ему петицию. Можно сделать пару комнат с головоломками, выдающих гг предметы для друзей. 

Квесты он нпс к примеру: принеси вишенку с пика горы или я дам тебе код от двери: qwerty, а ты мне принесешь 50% содержимого комнаты.
        
И вот предложение: первое место куда отправили гг -- это покорять высоты. Гг охуеет от жизни тип... Бля, а нахуй мне меч, если надо забраться на верх. Пропаркурит, доберется до пещеры у пика. Там он встретит офисного планктона, который сидит в бумагах и весь в 10 слоях одежды. На вопрос хули он в одежде, если здесь не холодно, он ответит, ТЫ СТЕБЕШЬСЯ?! ТУТ ЦЕЛЫХ -20°, мне термометр сказал. Офисный челик выдает нам петицию и отпускает. Выйдя из пещеры начнется ночь, начинаем спуск и... ЛАВИНА! В начале дельтаруна была не плохая игра тип ты должен упорачиваться от снарядов по вертикали и горизонтали будучи в падении. Мы повторим такой концепт.Гг приземляется в крем, рядом поджидает Люми. Конец локации

Портал: тип надо собрать печати важных шишек чтобы выбраться
День и ночь -- описал выше как пример реализации на горе сладостей
Может быть выглядит и много, но таков сюжет.
Ну точнее если делать переход от дня к ночи по сюжету, но встроится хорошо
`
      },
      coasts: {
        id: 'coasts',
        title: 'Лава-карамельные берега',
        description: 'Жаркое место',
        content: `
        Берега, локация где можно наставить кучу вулканов с плавленной карамелью. Наша задача добраться до Бани, где будет сидеть местный гачимученик, у которого мы должны будем получить печать. Задача от него, пересидеть в бане. Предложения для миниигры... Qte ивенты и переклики. Победим босса, получим его респект и печать. Сам гачимученик может в будущем появиться в таверне, тип пришел посидеть, увидеть знакомые лица. Характер боевой заряженный, ищущий достойного соперника.
Получив печать выходим из бани и ночь наступает. На улице темно и видны лишь силуэты глаз несущихся в нашу сторону. Наша задача бегать от огненой лунке к лунке, тип свет отпугивает тварь. Выйдем с локации и уже в таверне.

Идеи для головоломок: один из вулканов имеет фейковый огонь: гг должен прыгнуть в него.
        `,
      },

      swamp: {
        id: 'swamp',
        title: 'Болота кислой сласти',
        description: 'Затягивающее место',
        content: `
        Болота, тут можно сделать дом ведьмы. Тут будет мини игра наподобие растений против замби.

Нам предложат переждать ночь у них. И тут можно дать предложение игроку пройти усложненную миниигру, где некий аноним призывает одурманеных. Затем уже гг возвращается

Квесты: собери кислые ягоды с деревьев
Спаси поставщика, увяз в кислой яме
Можно чтобы игрок ещё бегал к ведьмам и кидал им требуемые предметы

-----

Мини игра на менеджмент в стиле пвз. 

Есть 3 или 4 ряда, на левом крою каждого ряда стоит ведьма с котлом (или один большой котёл и несколько ведьм рядом тусуются). В это время наступают кислые твари/одурманенные черти. 

Рядом с рядами (ну или прямо на рядах) растут травы. Траву надо сорвать и принести ведьме. Ведьма жалуется на качество травы: 
- Ты чёрт! Зачем ты принёс травы с корнями!?
- А зрелую принести не мог?
- Умничка <3 Теперь ты съешь это цветок. Потому что ты его сломал!

Из травы ведьмы готовят яды, яды надо разливать на землю, черти наступившие на яд умирают.

Ведьмам можно задать вопрос: 
- Чего ты сама не принесешь себе травки?

на что поступают вариации ответов:
- Не могу оторваться от готовки ~
- Ты сильный ^•°
- Я ноготки накрасила >_<
- Гари в аду ×~×
        `,
      },


      desert: {
        id: 'desert',
        title: 'Песочные дюны печенья',
        description: 'Подобие пустыни',
        content: `
        На входе будет ждать черт, который говорит, что надвигается буря и что лучше не идти, но мы сигмы нам похуй. Танки грязи не бояться, делаем шаг и нас утягивает песок вниз. Просыпаемся, рядом Люси. Подземное королевство печенья. Тут можно сделать что-то либо на подобие востания и сделаем отсылку на шрека с гиганским печеньем рейдящим замок, либо королева данных печенечных подземных земель будет искать достойного рыцаря путем арены. В любом случае доходим до трона, получаем печать и пытаемся выбраться. Здесь не будет ночи, т.к. под землей хули. 

Персонажи мест это принцесса земель
Соперник гг, который мог быть и на предыдущих лвлах
Король печенеговых земель

Квесты: сюжетные квесты если будет штурм  замка
Квест -- спизди че-нибудь из сокровищницы короля: его парик
Найди рецепт песчаного напитка
Наладь поставки строй материалов: песка в другие земли
        `,
      },


    }
  },
  general: {
    id: 'general',
    title: 'Общее',
    description: 'Разное об игре',
    icon: lumiInSquare,
    items: {
      lore: {
        id: 'lore',
        title: 'Кратко об игре',
        description: 'Все что есть об игре, но кратко',
        content: `
        "Sweet Hell" - это 2D пиксельная игра с переключением между видом сбоку (платформер) и видом сверху сбоку (как в rpg maker), переключение происходит в зависимости от локаций и места где находится игрок. Основной геймплей - диалоги и мини игры.

Главный герой попадает в ад. В ад попадают плохиши, а в зависимости от гото сколько плохих дел ты сделал, соответственно меняется облик. Главный герой не делал плохих дел и он полностью выглядит как человек. По мере диалогов есть кнопки "оскорбить" и "ударить", если ГГ оскорбляет, то ничего не происходит, если ГГ ударит 5 раз, то он станет чертом.

Словарь: *смена дня и ночи - это условное обозначение резкой смены событий чтобы ГГ не расслаблялся, будь то ночь, лавина или бешенные черти.
*Смена дня и ночи происходит быстро. Днём все норм. Ночью надо отбиваться от чертей или убегать от кого-то, черт умирает от одного прокола карамельным копьём. Копье можно добыть у Темми.

Словарь: *портал - это условное обозначение точки перехода персонажа с одной локации в другую, это какое-то испытание. Портал может быть выражен платформером на верх, персонажем-приградой или чем-то другим.

Главному герою не понравилось в аду и он решает найти выход. В локации ада есть *портал, в портал можно зайти только после какого-то челенджа. При перемещении через портал главный герой попадает в "другую версию ада" в ту же самую локацию, но с другой расцветкой и атмосферой, у персонажей другие характеры и диалоги.

Старые идеи порталов: 
- перед первым порталом стоит страж которы йспустит ГГ только по пропуску, гг узнает у Люми что пропуск можно добыть у бармена, бармен дает пропуск за решение его загадки
- второй портал заморожен во льде, открывается кликер и кликаешь чтобы растопить портал
- другие придуманы, но не заполнены

Версии ада:
- карамельный ад (исходный)
- мятный ад (депрессивный)
- пережаренный ад (агрессивный)
- другие придуманы, но не заполнены

Локации:
- Площадь Плачущего Черепа,
- Пьяная Вишня,
- Застывший Крик (база Люцефера, перед ней стоит охранник)
- другие придуманы, но не заполнены

Персонажи:
- ГГ (харизматичный, быстро меняет эмоции, быстро паникует, быстро успокаивается.)
- Люми (девочка демон, по характеру пытается быть крутой но у неё все валится из рук).
- Бармен (старик который все увидел в этой жизни, сдержанный, обзывается)
- Темми (забавный барахольщик)
- Люцефер
- стражи Люцефера
- другие придуманы, но не заполнены

Концовки:
- нейтральная концовка: если ГГ за всю игру никого не ударил, то перед третьим порталом стоит Люцефер и говорит "ты слишком скучный для ада", после в хода в партал ГГ просыпается у себя дома и оказалось что он переел конфет на ночь
- концовка геноцида (убить всех): если ГГ бил npc то он стал чертом(убийство чертей не делает ГГ чертом), теперь при открытии любого диалога есть кнопка "убить", ГГ убивает стража базы Люцефера, самого Люцефера, садистя на трон и становится боссом ада, пустого ада
- концовка должна быть доброй ко всем персонажам
- если пойти на левый обрыв карты после 10 разговоров с npc и пройти в пропость, но начинашь идти по пустоте, проходишь левее и экран темнеет, появляется забагованый черт и в диалогес ним можно сказать "этот мир странный, выглядит как игра", то черт рассмеестя, пропадет и появистя кнопка "отсановить это", после нажатия игра сворачивается
- гг найдет истинную личину ада, либо останется со всеми. Под истинной личиной имеется ввиду тип... Сладкий ад, ад не адский
        
        `,
      },
      hellSong: {
        id: 'hellSong',
        title: 'Идея песни',
        description: 'Песня планируется как способ популяризации игры и авторов проекта, пока имеется только текст',
        content: `
        Он просто тот кто случайно попал в ад
"Как я здесь очутился..."
И здесь ему кажный будет рад
"Он рад мной подкрепиться"

И эта случайность его завела 
Он вырезал всех он сошёл блин сума

*проигровка

Я пью кровь черта
Я здесь навсегда
Я чувствую ад
Я здесь очень рад

Как здесь тепло, здесь вечное лето
Развел мангал - я готовлюсь к обеду
Это мясо добыл я сам - я не видел кого убивал

Построил лодку - нашёл новый остов
Здесь так тихо, здесь яркие звезды
Найти бы мне друга...
Но кого я не увижу все бегут от испуга

Прекрасный мой
Ад ад ад

Прекрасный мой
Ад ад ад

Мой милый ад


Идея звучания взятя из: https://youtu.be/U4lz8MN6MQA
        `,
      },

      hellVideo: {
        id: 'hellVideo',
        title: 'Идея видео',
        description: 'Видео планируется как способ популяризации игры и авторов проекта, пока имеется только текст',
        details: 'В видео будет простая нарезка разных концептов Люми и финальный ее результат',
        content: `
        Придумай имя, нарисуй схематично, прогони через нейронку, нарисуй в своём стиле.

Гг попадает в ад в конфетном стиле, его встречаем милая аниме девочка демон, придумай ей имя.

Люми

Нарисуй её

Погрязнуть в генерации и собрать гигабайт аниме тян

Добавить в годот демку

Генерировать больше аниме тян

Устать от генерации

Придумать и нарисовать самому

Генерировать по рисунку

Найти конфетку

Нарисовать в пикселях в фотошопе 

Скачать нормальную программу для пикселей 

Взять персонажа Отеля Хазбин

Сделать свою конфетку

Сделать анимацию стойки

Сделать анимацию движения

Пытаться рисовать самостоятельно

Найти художника и почувствовать счастье

Через 2 часа получить нереально классную Люми

Радоваться жизни


Начать придумывать сюжет игры...
        `,
      },


    }
  }
};

// Вспомогательные функции для удобной работы с данными
export const getCategories = () => {
  return Object.values(gameData);
};

export const getCategory = (categoryId) => {
  return gameData[categoryId];
};

export const getSubCategories = (categoryId) => {
  const category = gameData[categoryId];
  return category ? Object.values(category.items) : [];
};

export const getItem = (categoryId, itemId) => {
  const category = gameData[categoryId];
  return category ? category.items[itemId] : null;
};